app/views/advertisements/index.html.erb

  <% @advertisements.each do |advertisement| %>
  <% @advertiser = User.find(advertisement.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]