app/views/advertisements/show.html.erb

    <div class="comment-container">
      <p class="comment">Posté par : <strong><%= User.find(c.user_id).name %></strong> | <%= c.content.capitalize %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."advertisement_id" = ?  [["advertisement_id", 4]]