app/controllers/advertisements_controller.rb

SELECT COUNT(*) FROM "advertisements"
SELECT COUNT(*) FROM "comments"
---
  def landing
    @how_many_ad = Advertisement.count
    @how_many_com = Comment.count

SELECT COUNT(*) FROM "advertisements"
SELECT "advertisements".* FROM "advertisements"
SELECT "advertisements".* FROM "advertisements" WHERE "advertisements"."published" = ?  [["published", "t"]]
---
  def index
    @how_many_ad = Advertisement.count
    if @current_user != nil && @current_user.role == 'admin'
      @advertisements = Advertisement.all
    else
      @advertisements = Advertisement.where(published: true)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."advertisement_id" = ?  [["advertisement_id", 4]]
---
  def show
    # checking if the person who accesses the unpublished advertisements is an admin
    @advertiser = User.find(@advertisement.user_id)
    if @advertisement.published == false && session[:user_id] == nil || @advertisement.published == false && @current_user.role != "admin"
      flash[:not_admin] = "Vous ne faites pas partie de l'équipe d'administration !"
      return redirect_to "/advertisements"
    else
    end
    # part of the show action that is about comments
    @comment = Comment.new
    @comments = Comment.where(advertisement_id: @advertisement.id)

INSERT INTO "advertisements" ("title", "price", "content", "user_id", "published", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "Blep"], ["price", 6], ["content", "HU"], ["user_id", 10], ["published", "f"], ["created_at", "2017-05-10 15:02:55.980335"], ["updated_at", "2017-05-10 15:02:55.980335"]]
---
  def create
    if advertisement_params[:published] == nil
      @advertisement = Advertisement.new(advertisement_params.merge!(published: false, user_id: session[:user_id]))
    else
      @advertisement = Advertisement.new(advertisement_params)
    end

    respond_to do |format|
      if @advertisement.save

UPDATE "advertisements" SET "content" = ?, "updated_at" = ? WHERE "advertisements"."id" = ?  [["content", "aie aie aie !"], ["updated_at", "2017-05-29 22:33:20.073727"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @advertisement.update(advertisement_params)

DELETE FROM "advertisements" WHERE "advertisements"."id" = ?  [["id", 3]]
---
  def destroy
    @advertisement.destroy

SELECT  "advertisements".* FROM "advertisements" WHERE "advertisements"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_advertisement
      @advertisement = Advertisement.find(params[:id])