app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
  def index
    if session[:user_id] == nil || @current_user.role != 'admin'
      flash[:not_admin] = "Vous ne faites pas partie de l'équipe d'administration !"
      redirect_to "/advertisements"
    else
      @comments = Comment.all

INSERT INTO "comments" ("user_id", "content", "created_at", "updated_at", "advertisement_id") VALUES (?, ?, ?, ?, ?)  [["user_id", 6], ["content", "ouglou"], ["created_at", "2017-05-17 14:26:40.354585"], ["updated_at", "2017-05-17 14:26:40.354585"], ["advertisement_id", 5]]
---
  def create
    @comment = Comment.new(comment_params.merge!(user_id: session[:user_id]))

    respond_to do |format|
      if @comment.save