app/controllers/users_controller.rb

SELECT COUNT(*) FROM "users"
SELECT "users".* FROM "users"
---
  def index
    @how_many_users = User.count
    if session[:user_id] == nil || @current_user.role != 'admin'
      flash[:not_admin] = "Vous ne faites pas partie de l'équipe d'administration !"
      redirect_to "/advertisements"
    else
      @users = User.all

INSERT INTO "users" ("name", "password", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Balala"], ["password", "123"], ["role", "user"], ["created_at", "2017-05-08 07:15:47.106750"], ["updated_at", "2017-05-08 07:15:47.106750"]]
---
  def create
    if user_params[:role] == '' || user_params[:role] == nil
      @user = User.new(user_params.merge!(role: 'user'))
    else
      @user = User.new(user_params)
    end

    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Dingo"], ["updated_at", "2017-05-10 08:21:09.110266"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."name" = ? AND "users"."password" = ? ORDER BY "users"."id" ASC LIMIT ?  [["name", "Balala"], ["password", "123"], ["LIMIT", 1]]
---
  def login_check
    @current_user = User.where(name: params[:name], password: params[:password]).first